tscas/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          dynamicMeshDict;
}

dynamicFvMesh   adaptiveFvMesh;

refiner         polyRefiner;

errorEstimator  coded;
name emulateDelta;

codeInclude #{
    #include "meshSearch.H"
    #include "triSurfaceMesh.H"
#};

codeOptions #{
    -I$(LIB_SRC)/surfMesh/lnInclude
#};

codeLibs #{
    -lsurfMesh
#};

code
#{
    error_ = 0.0;
    /*
        End result must be (error_ is a volScalarField):
        - error_ == 1  if the cell needs to be refined
        - error_ == 0  if the cell is to be left alone
        - error_ == -1 if the vertices of the cell are to be unrefined
    */

    const auto& alpha = mesh_.lookupObject<volScalarField>("alpha.water");
    const auto& owner = mesh_.owner();
    const auto& neighbour = mesh_.neighbour();
    const label nInternalFaces = mesh_.nInternalFaces();
    // Loop through interal faces and store difference between owner and neighbour
    for (label facei = 0; facei < nInternalFaces; facei++)
    {
        label own = owner[facei];
        label nei = neighbour[facei];
        scalar eT = mag(alpha[own] - alpha[nei]);
        error_[own] = max(error_[own], eT);
        error_[nei] = max(error_[nei], eT);
    }
    // Settings for "refining everything where delta > 0.01, unrefine otherwise"
    lowerRefine_ = 0.01;
    upperRefine_ =  GREAT;
    lowerUnrefine_ = lowerRefine_;
    upperUnrefine_ =  GREAT;
    // This converts error_ to the right values (-1, 0, 1) based on the
    // settings lowerRefine_ ... etc
    if (scale) normalize(error_);

    // Apply STL refinement
    // overrides error_ value with 1 if cell is to be refined by STL
    // this is INEFFICIENT (re-reads STL file), but serves as a good example
    triSurfaceMesh tri
    (
        IOobject(
            "surface_refined.stl",
            mesh_.time().caseConstant()/"triSurface",
            mesh_,
            IOobject::MUST_READ,
            IOobject::NO_WRITE,
            false,
            true
        )
    );
    meshSearch meshSearcher(mesh_);
    const auto& coords = tri.points()();
    forAll(coords, ci) {
        auto bfID = meshSearcher.findNearestBoundaryFace(coords[ci]);
        if (bfID > -1) {
            error_[mesh_.owner()[bfID]] = 1;
        }
    }
    // error_.correctBoundaryConditions() is called after this code in case you
    // need to manipulate boundary values
#};

balance         yes;

refineInterval  20;

unrefineInterval 100;

maxRefinement   3;

nBufferLayers   1;

nRefinementBufferLayers 1;

nUnrefinementBufferLayers 0;

lowerRefineLevel 0.01;

upperRefineLevel 0.99;

unrefineLevel   0.01;

upperUnrefineLevel 0.99;

dumpLevel       no;

refineProbes    no;


// ************************************************************************* //
