tscas/system/decomposeParDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object decomposeParDict;
}

numberOfSubdomains 8;

method hierarchical;

coeffs
{
  n (4 3 1);
}

